w7/w7d2/news-reader/app/controllers/api/favorite_feeds_controller.rb

  def create
    @favorite_feed = current_user.favorite_feeds.build(fav_params)
    if @favorite_feed.save
---
INSERT INTO "favorite_feeds" ("created_at", "feed_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 17 Sep 2014 00:26:03 UTC +00:00], ["feed_id", 7], ["updated_at", Wed, 17 Sep 2014 00:26:03 UTC +00:00], ["user_id", 6]]

  def destroy
    @favorite_feed = FavoriteFeed.find_by(
      user_id: current_user.id,
      feed_id: params[:id]
    )
    @favorite_feed.destroy!
---
SELECT "favorite_feeds".* FROM "favorite_feeds" WHERE "favorite_feeds"."user_id" = 6 AND "favorite_feeds"."feed_id" = 7 LIMIT 1
DELETE FROM "favorite_feeds" WHERE "favorite_feeds"."id" = $1  [["id", 1]]