w7/w7d2/news-reader/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "name", "password_digest", "session_token", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"